[
  {
    "title": "Base Components",
    "items": [
      {
        "title": "Accordion",
        "description": "A vertically stacked set of interactive headings that each reveal a section of content.",
        "url": "/accordion",
        "meta": {
          "description": "Interactive React accordion component with Tailwind CSS, Shadcn UI & Radix UI. Expand and collapse content sections easily."
        }
      },
      {
        "title": "Alert",
        "description": "Displays a callout for user attention.",
        "url": "/alert",
        "meta": {
          "description": "Displays a callout for user attention. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Alert Dialog",
        "description": "A modal dialog that interrupts the user with important content and expects a response.",
        "url": "/alert-dialog",
        "meta": {
          "description": "Captures user attention with an important modal prompt requiring a response. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Avatar",
        "description": "An image element with fallbacks for representing the user.",
        "url": "/avatar",
        "meta": {
          "description": "An image element with fallback options to represent users. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Badge",
        "description": "Displays a badge or status indicator.",
        "url": "/badge",
        "meta": {
          "description": "Shows a badge or status indicator to highlight information. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Breadcrumb",
        "description": "Displays a breadcrumb navigation.",
        "url": "/breadcrumb",
        "meta": {
          "description": "Provides breadcrumb navigation for easy site hierarchy tracking. Built with Tailwind CSS, shadcn/ui, radix ui and React.."
        }
      },
      {
        "title": "Button",
        "description": "Displays a button or a component that looks like a button.",
        "url": "/button",
        "meta": {
          "description": "Showcasing a customizable React button component built with Tailwind CSS, Shadcn UI & Radix UI for your projects."
        }
      },
      {
        "title": "Calendar",
        "description": "A date picker component with range and single date selection.",
        "url": "/calendar",
        "meta": {
          "description": "A date picker component supporting single and range selection. Built with Tailwind CSS, shadcn/ui, radix ui, react day picker and React."
        }
      },
      {
        "title": "Card",
        "description": "Displays a card with header, content, and footer.",
        "url": "/card",
        "meta": {
          "description": "A card component showcasing a header, content, and footer section. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Carousel",
        "description": "A carousel component for cycling through a series of content.",
        "url": "/carousel",
        "meta": {
          "description": "A carousel component for smoothly cycling through multiple content items. Built with Tailwind CSS, shadcn/ui, radix ui, embla carousel and React."
        }
      },
      {
        "title": "Chart",
        "description": "Beautiful charts. Built using Recharts. Copy and paste into your apps.",
        "url": "/chart",
        "meta": {
          "description": "Create beautiful and interactive charts for your projects. Built with Tailwind CSS, shadcn/ui, radix ui, recharts and React."
        }
      },
      {
        "title": "Checkbox",
        "description": "A control that allows the user to toggle between checked and not checked.",
        "url": "/checkbox",
        "meta": {
          "description": "A control that lets users toggle between checked and unchecked states. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Collapsible",
        "description": "Used to hide and show content with a smooth animation.",
        "url": "/collapsible",
        "meta": {
          "description": "Toggle content visibility with smooth animations using a collapsible component. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Combobox",
        "description": "Combines a text input with a list of options.",
        "url": "/combobox",
        "meta": {
          "description": "A text input paired with a selectable list of options. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Command",
        "description": "Fast, composable command palette component.",
        "url": "/command",
        "meta": {
          "description": "A fast and composable command palette for efficient navigation. Built with Tailwind CSS, shadcn/ui, radix ui, cmdk and React."
        }
      },
      {
        "title": "Context Menu",
        "description": "Displays a menu to the user — triggered by a right click.",
        "url": "/context-menu",
        "meta": {
          "description": "A menu that appears on right-click for quick actions. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Data Table",
        "description": "Display complex data in a table format with filtering, sorting and pagination.",
        "url": "/data-table",
        "meta": {
          "description": "Organize and display complex data with sorting, filtering, and pagination. Built with Tailwind CSS, shadcn/ui, radix ui, tanstack table and React."
        }
      },
      {
        "title": "Date Picker",
        "description": "A styled date picker component built using calendar.",
        "url": "/date-picker",
        "meta": {
          "description": "A styled component for selecting dates easily. Built with Tailwind CSS, shadcn/ui, radix ui, react day picker and React."
        }
      },
      {
        "title": "Dialog",
        "description": "A window overlaid on either the primary window or another dialog window.",
        "url": "/dialog",
        "meta": {
          "description": "An overlay window that appears above the main or another dialog. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Drawer",
        "description": "A panel that slides out from the edge of the screen.",
        "url": "/drawer",
        "meta": {
          "description": "A sliding panel that appears from the screen edge. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Dropdown Menu",
        "description": "Displays a menu to the user — triggered by a button.",
        "url": "/dropdown-menu",
        "meta": {
          "description": "A menu that opens on button click for easy selection. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Hover Card",
        "description": "For sighted users to preview content available behind a link.",
        "url": "/hover-card",
        "meta": {
          "description": "Allows users to preview content on hover before clicking a link. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Input",
        "description": "Displays a form input field or a component that looks like an input field.",
        "url": "/input",
        "meta": {
          "description": "A form input field for user data entry or interactive input. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Input OTP",
        "description": "Accessible one-time password component with copy paste functionality.",
        "url": "/input-otp",
        "meta": {
          "description": "An accessible one-time password input with copy-paste support. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Menubar",
        "description": "Displays a menu bar with nested menus.",
        "url": "/menubar",
        "meta": {
          "description": "A menu bar component with nested menus for easy navigation. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Navigation Menu",
        "description": "A set of layered menu items—triggered by hover or click.",
        "url": "/navigation-menu",
        "meta": {
          "description": "A layered menu system triggered by hover or click for easy navigation. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Pagination",
        "description": "Pagination with page navigation, next and previous links.",
        "url": "/pagination",
        "meta": {
          "description": "Navigate through pages with next, previous, and page links. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Popover",
        "description": "A pop-up element that appears next to a trigger element.",
        "url": "/popover",
        "meta": {
          "description": "A pop-up element that appears beside a trigger for extra information. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Progress",
        "description": "Displays an indicator showing the completion progress of a task.",
        "url": "/progress",
        "meta": {
          "description": "Shows a visual indicator of task completion progress. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Radio Group",
        "description": "A set of checkable buttons—only one can be selected at a time.",
        "url": "/radio-group",
        "meta": {
          "description": "A group of selectable buttons where only one option can be chosen. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Select",
        "description": "Displays a list of options for the user to pick from—triggered by a button.",
        "url": "/select",
        "meta": {
          "description": "A selectable list of options triggered by a button for user choice. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Sheet",
        "description": "Extends the Dialog component to create panels that slide in from the edge of the screen.",
        "url": "/sheet",
        "meta": {
          "description": "Panels that slide in from the screen edge, extending the dialog functionality. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Sidebar",
        "description": "A composable, themeable and customizable sidebar component.",
        "url": "/sidebar",
        "meta": {
          "description": "A flexible sidebar component that’s composable, themeable, and customizable. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Skeleton",
        "description": "Displays a placeholder preview of your content before it loads.",
        "url": "/skeleton",
        "meta": {
          "description": "A placeholder preview that mimics content layout before loading. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Slider",
        "description": "An input where the user selects a value from within a given range.",
        "url": "/slider",
        "meta": {
          "description": "An input control for selecting a value within a defined range. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Switch",
        "description": "A control that allows the user to toggle between checked and not checked.",
        "url": "/switch",
        "meta": {
          "description": "A toggle control that lets users switch between on and off states. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Tabs",
        "description": "A set of layered sections of content—known as tab panels—that are displayed one at a time.",
        "url": "/tabs",
        "meta": {
          "description": "Organize content into tab panels, displaying one section at a time. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Toggle Group",
        "description": "A set of two-state buttons that can be toggled on or off.",
        "url": "/toggle-group",
        "meta": {
          "description": "A group of toggle buttons allowing on/off states for each option. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      },
      {
        "title": "Tooltip",
        "description": "A popup that displays information related to an element when hovered.",
        "url": "/tooltip",
        "meta": {
          "description": "A popup showing contextual information when hovering over an element. Built with Tailwind CSS, shadcn/ui, radix ui and React."
        }
      }
    ]
  },
  {
    "title": "Marketing",
    "url": "#",
    "items": [
      {
        "title": "Hero Sections",
        "description": "Use these Tailwind CSS hero section examples to showcase messaging, product images, and calls-to-action at the top of your site, featuring various styles and layouts.",
        "url": "/hero-sections",
        "meta": {
          "description": "Showcase key messaging, product images, and calls-to-action at the top of your site. Hero sections built with Tailwind CSS, Shadcn UI & React."
        }
      },
      {
        "title": "CTA Sections",
        "description": "Use these Tailwind CSS CTA section examples to encourage visitors to take action and sign up, with various styles and layouts.",
        "url": "/cta-sections",
        "meta": {
          "description": "Encourage visitors to take action and sign up with engaging CTA sections. Built with Tailwind CSS, Shadcn UI & React."
        }
      },
      {
        "title": "Pricing Sections",
        "description": "Use these Tailwind CSS pricing section examples to present your pricing model with various styles and layouts.",
        "url": "/pricing-sections",
        "meta": {
          "description": "Present your pricing plans clearly with stylish pricing sections. Built with Tailwind CSS, Shadcn UI & React."
        }
      },
      {
        "title": "Newsletter Sections",
        "description": "Use these Tailwind CSS newsletter section examples to convert visitors into email subscribers with various styles and layouts.",
        "url": "/newsletter-sections",
        "meta": {
          "description": "Convert visitors into email subscribers with engaging newsletter sections. Built with Tailwind CSS, Shadcn UI & React."
        }
      },
      {
        "title": "Testimonials",
        "description": "Use these Tailwind CSS testimonial examples to add social proof and build trust with visitors, featuring various styles and layouts.",
        "url": "/testimonials",
        "meta": {
          "description": "Add social proof and build trust with stylish testimonial sections. Built with Tailwind CSS, Shadcn UI & React."
        }
      },
      {
        "title": "Blog Sections",
        "description": "Use these Tailwind CSS blog section examples to showcase engaging content from your blog across your site, with various styles and layouts.",
        "url": "/blog-sections",
        "meta": {
          "description": "Showcase engaging blog content across your site with stylish blog sections. Built with Tailwind CSS, Shadcn UI & React."
        }
      },
      {
        "title": "Team Sections",
        "description": "Use these Tailwind CSS team section examples to introduce your team to customers, featuring various styles and layouts.",
        "url": "/team-sections",
        "meta": {
          "description": "Introduce your team to visitors with visually appealing team sections. Built with Tailwind CSS, Shadcn UI & React."
        }
      }
    ]
  }
]